

&НаКлиенте
Процедура ТоварыИсполненоПриИзменении(Элемент)
	Модифицированность = Ложь;
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыТоваров.Товар,
	|	СтатусыТоваров.Исполнено
	|ИЗ
	|	РегистрСведений.СтатусыТоваров КАК СтатусыТоваров
	|ГДЕ
	|	СтатусыТоваров.СписокТоваров = &СписокТоваров";
	
	Запрос.УстановитьПараметр("СписокТоваров", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Для Каждого СтрокаТовары Из Объект.Товары Цикл
			
			Если Выборка.НайтиСледующий(СтрокаТовары.Товар) Тогда
				СтрокаТовары.Исполнено = Выборка.Исполнено;
			КонецЕсли;
			
			Выборка.Сбросить();
			
		КонецЦикла; 
		
	КонецЕсли;
		
КонецПроцедуры
